---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.AllInvisibleInPlanViewWarn
source: html/72e42fbb-3bd0-305e-23ee-1affe0004731.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.AllInvisibleInPlanViewWarn Property

None of the created elements are visible in [View Type] View. You may want to check the active view, its Parameters, and Visibility settings, as well as any Plan Regions and their settings.

## Syntax (C#)
```csharp
public static FailureDefinitionId AllInvisibleInPlanViewWarn { get; }
```